Sebkabob/TheWatchDogBT/STM32_BLE/App/lockservice_app.c
    // Convert tick timestamp to real date/time
    uint8_t year, month, day, hour, minute, second;
    MotionLogger_TickToDateTime(event->timestamp_ms, &year, &month, &day, &hour, &minute, &second);

    // Pack event data
    uint8_t dataIdx = 0;
    a_LOCKSERVICE_UpdateCharData[dataIdx++] = RESP_EVENT_DATA;
    a_LOCKSERVICE_UpdateCharData[dataIdx++] = (index >> 8) & 0xFF;  // Index high byte
    a_LOCKSERVICE_UpdateCharData[dataIdx++] = index & 0xFF;         // Index low byte
    a_LOCKSERVICE_UpdateCharData[dataIdx++] = year;
    a_LOCKSERVICE_UpdateCharData[dataIdx++] = month;
    a_LOCKSERVICE_UpdateCharData[dataIdx++] = day;
    a_LOCKSERVICE_UpdateCharData[dataIdx++] = hour;
    a_LOCKSERVICE_UpdateCharData[dataIdx++] = minute;
    a_LOCKSERVICE_UpdateCharData[dataIdx++] = second;
    a_LOCKSERVICE_UpdateCharData[dataIdx++] = event->motionType;

    // Add deviceBattery to match your status update format
    a_LOCKSERVICE_UpdateCharData[dataIdx++] = deviceBattery;

    LOCKSERVICE_Data_t lockservice_notification_data;
    lockservice_notification_data.p_Payload = (uint8_t*)a_LOCKSERVICE_UpdateCharData;
    lockservice_notification_data.Length = dataIdx;  // Should be 11 now

    LOCKSERVICE_NotifyValue(LOCKSERVICE_DEVICESTATUS, &lockservice_notification_data,
                           LOCKSERVICE_APP_Context.ConnectionHandle);
}

/**
 * @brief Send log cleared confirmation
 */
static void LOCKSERVICE_SendLogCleared(void)
{
    if (LOCKSERVICE_APP_Context.ConnectionHandle == 0xFFFF) {
        return;
    }

    a_LOCKSERVICE_UpdateCharData[0] = RESP_LOG_CLEARED;

    LOCKSERVICE_Data_t lockservice_notification_data;
    lockservice_notification_data.p_Payload = (uint8_t*)a_LOCKSERVICE_UpdateCharData;
    lockservice_notification_data.Length = 1;

    LOCKSERVICE_NotifyValue(LOCKSERVICE_DEVICESTATUS, &lockservice_notification_data,
                           LOCKSERVICE_APP_Context.ConnectionHandle);
}

/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void LOCKSERVICE_Notification(LOCKSERVICE_NotificationEvt_t *p_Notification)
{
  /* USER CODE BEGIN Service1_Notification_1 */

  /* USER CODE END Service1_Notification_1 */
  switch(p_Notification->EvtOpcode)
  {
    /* USER CODE BEGIN Service1_Notification_Service1_EvtOpcode */

    /* USER CODE END Service1_Notification_Service1_EvtOpcode */

    case LOCKSERVICE_APPTOWD_WRITE_EVT:
      /* USER CODE BEGIN Service1Char1_WRITE_EVT */
    	StateMachine_UpdateBLEActivity();
    	uint8_t *received_data = p_Notification->DataTransfered.p_Payload;
    	    uint8_t data_length = p_Notification->DataTransfered.Length;

    	    if(data_length > 0)
    	    {
    	        uint8_t command = received_data[0];

    	        // Only extract timestamp if this is the initial boot time sync command
    	        // (typically sent with the first connection or settings update)
    	        if (data_length >= 7 && command != CMD_REQUEST_EVENT &&
    	            command != CMD_REQUEST_LOG_COUNT && command != CMD_CLEAR_LOG &&
    	            command != CMD_ACK_EVENT && command != CMD_FIND_MY_DEVICE &&
    	            command != CMD_RESET_DEVICE) {
    	            // This is a settings update with timestamp
    	            UpdateBootTimeFromiOS(&received_data[data_length - 6]);
    	        }

    	        switch(command) {
    	            case CMD_REQUEST_LOG_COUNT:
    	                transferInProgress = 1;
    	                currentEventIndex = 0;
    	                LOCKSERVICE_SendEventCount();
    	                break;

    	            case CMD_REQUEST_EVENT:
    	                if (data_length >= 3) {
    	                    uint16_t requestedIndex = ((uint16_t)received_data[1] << 8) | received_data[2];
    	                    LOCKSERVICE_SendEvent(requestedIndex);
    	                }
    	                break;

    	            case CMD_ACK_EVENT:
    	                // iOS acknowledged receiving event
    	                break;

    	            case CMD_CLEAR_LOG:
    	                MotionLogger_Clear();
    	                transferInProgress = 0;
    	                currentEventIndex = 0;
    	                LOCKSERVICE_SendLogCleared();
    	                break;

    	            case CMD_FIND_MY_DEVICE:
    	                if (data_length >= 2 && (received_data[1] & 0x01)) {
    	                    FindMyDevice_Start();
    	                }
    	                break;

    	            case CMD_RESET_DEVICE:
    	                NVIC_SystemReset();
    	                break;

    	            case CMD_DRAIN_MODE:
    	                if (data_length >= 2 && (received_data[1] & 0x01)) {
    	                    Drain_Start();
    	                } else {
    	                    Drain_Stop();
    	                }
    	                break;

    	            default:
    	                // Regular device state update
    	                deviceState = received_data[0];
    	                if (data_length >= 2) {
    	                    deviceInfo = received_data[1];
    	                }
    	                HAL_Delay(5);
    	                LOCKSERVICE_ForceStatusUpdate();
    	                break;
    	        }
    	    }
    	    break;
      /* USER CODE END Service1Char1_WRITE_EVT */
      break;

    case LOCKSERVICE_DEVICESTATUS_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN Service1Char2_NOTIFY_ENABLED_EVT */
    	LOCKSERVICE_ForceStatusUpdate();
      /* USER CODE END Service1Char2_NOTIFY_ENABLED_EVT */
      break;

    case LOCKSERVICE_DEVICESTATUS_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN Service1Char2_NOTIFY_DISABLED_EVT */

      /* USER CODE END Service1Char2_NOTIFY_DISABLED_EVT */
      break;

    default:
      /* USER CODE BEGIN Service1_Notification_default */

      /* USER CODE END Service1_Notification_default */
      break;
  }
  /* USER CODE BEGIN Service1_Notification_2 */

  /* USER CODE END Service1_Notification_2 */
  return;
}

void LOCKSERVICE_APP_EvtRx(LOCKSERVICE_APP_ConnHandleNotEvt_t *p_Notification)
{
  /* USER CODE BEGIN Service1_APP_EvtRx_1 */

  /* USER CODE END Service1_APP_EvtRx_1 */

