Sebkabob/TheWatchDogBT/STM32_BLE/App/lockservice_app.c
/******************************************************************************
 * Drain Mode — gauge-health diagnostic
 *
 * Drives the device into a high-load state so the fuel gauge can characterise
 * the battery: white LED at full brightness + continuous 100 Hz buzzer tone.
 * Auto-stops once SOC drops to DRAIN_AUTO_STOP_SOC (5 %).
 *****************************************************************************/

void Drain_Start(void)
{
    if (drain_mode_active) return;
    drain_mode_active = 1;
    LED_Solid(255, 255, 255, 255);
    BUZZER_StartContinuousTone(DRAIN_TONE_FREQUENCY_HZ);
}

void Drain_Stop(void)
{
    if (!drain_mode_active) return;
    drain_mode_active = 0;
    BUZZER_Stop();
    LED_Off();
}

uint8_t Drain_IsActive(void)
{
    return drain_mode_active;
}

void Drain_Tick(void)
{
    if (!drain_mode_active) return;

    /* Auto-stop when battery is sufficiently drained. */
    if (BATTERY_GetSOC() <= DRAIN_AUTO_STOP_SOC) {
        Drain_Stop();
        return;
    }

    /* Re-assert outputs every tick so other subsystems (state machine,
     * alarm patterns) can't override us while drain is active. */
    LED_Solid(255, 255, 255, 255);
    if (!BUZZER_IsPlaying()) {
        BUZZER_StartContinuousTone(DRAIN_TONE_FREQUENCY_HZ);
    }
}
/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
__USED void LOCKSERVICE_Devicestatus_SendNotification(void) /* Property Notification */
{
  LOCKSERVICE_APP_SendInformation_t notification_on_off = Devicestatus_NOTIFICATION_OFF;
  LOCKSERVICE_Data_t lockservice_notification_data;

  lockservice_notification_data.p_Payload = (uint8_t*)a_LOCKSERVICE_UpdateCharData;
  lockservice_notification_data.Length = 0;

  /* USER CODE BEGIN Service1Char2_NS_1*/
  	notification_on_off = Devicestatus_NOTIFICATION_ON;

    /* Use cached battery values */
    uint16_t voltage_mV = BATTERY_GetVoltage();
    int16_t current_mA = BATTERY_GetCurrent();
    uint16_t soc_percent = BATTERY_GetSOC();

    deviceBattery = soc_percent & 0x7F;

    /* Set charging flag: cable plugged AND actually charging AND gauge not full */
    if (IS_CABLE_PLUGGED() && IS_CHARGING_NOW() && !BATTERY_IsFullCached()) {
        SET_BATTERY_CHARGING(deviceBattery);
    } else {
        CLEAR_BATTERY_CHARGING(deviceBattery);
    }

    /* Read live accelerometer data */
    int16_t accel[3];
    LIS2DUX12_ReadAcceleration(accel);

    /* Pack data into BLE notification — 16 bytes
     * Bytes 14..15 carry the low 2 bytes of the BD address (LE), used by
     * the iOS app as the user-visible "WatchDog #" identifier in Settings. */
    a_LOCKSERVICE_UpdateCharData[0]  = deviceState;
    a_LOCKSERVICE_UpdateCharData[1]  = deviceBattery;
    a_LOCKSERVICE_UpdateCharData[2]  = (uint8_t)(current_mA & 0xFF);
    a_LOCKSERVICE_UpdateCharData[3]  = (uint8_t)((current_mA >> 8) & 0xFF);
    a_LOCKSERVICE_UpdateCharData[4]  = (uint8_t)(voltage_mV & 0xFF);
    a_LOCKSERVICE_UpdateCharData[5]  = (uint8_t)((voltage_mV >> 8) & 0xFF);
    a_LOCKSERVICE_UpdateCharData[6]  = lis2dux12_app_get_cached_mlc_state();
    a_LOCKSERVICE_UpdateCharData[7]  = (uint8_t)(accel[0] & 0xFF);
    a_LOCKSERVICE_UpdateCharData[8]  = (uint8_t)((accel[0] >> 8) & 0xFF);
    a_LOCKSERVICE_UpdateCharData[9]  = (uint8_t)(accel[1] & 0xFF);
    a_LOCKSERVICE_UpdateCharData[10] = (uint8_t)((accel[1] >> 8) & 0xFF);
    a_LOCKSERVICE_UpdateCharData[11] = (uint8_t)(accel[2] & 0xFF);
    a_LOCKSERVICE_UpdateCharData[12] = (uint8_t)((accel[2] >> 8) & 0xFF);
    a_LOCKSERVICE_UpdateCharData[13] = deviceInfo;
    a_LOCKSERVICE_UpdateCharData[14] = g_bd_address[0]; /* WatchDog # low byte  (LSB of BD addr) */
    a_LOCKSERVICE_UpdateCharData[15] = g_bd_address[1]; /* WatchDog # high byte */

    lockservice_notification_data.Length = 16;
  /* USER CODE END Service1Char2_NS_1*/

  if (notification_on_off != Devicestatus_NOTIFICATION_OFF && LOCKSERVICE_APP_Context.ConnectionHandle != 0xFFFF)
  {
    LOCKSERVICE_NotifyValue(LOCKSERVICE_DEVICESTATUS, &lockservice_notification_data, LOCKSERVICE_APP_Context.ConnectionHandle);
  }

  /* USER CODE BEGIN Service1Char2_NS_Last*/

  /* USER CODE END Service1Char2_NS_Last*/

  return;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS*/

/* USER CODE END FD_LOCAL_FUNCTIONS*/
